# 你正在探访一家农场，农场从左到右种植了一排果树。这些树用一个整数数组 fruits 表示，其中 fruits[i] 是第 i 棵树上的水果 种类 。
# 你想要尽可能多地收集水果。然而，农场的主人设定了一些严格的规矩，你必须按照要求采摘水果：
# 1.你只有 两个 篮子，并且每个篮子只能装 单一类型 的水果。每个篮子能够装的水果总量没有限制
# 2.你可以选择任意一棵树开始采摘，你必须从 每棵 树（包括开始采摘的树）上 恰好摘一个水果 。采摘的水果应当符合篮子中的水果类型。
#   每采摘一次，你将会向右移动到下一棵树，并继续采摘。
# 3.一旦你走到某棵树前，但水果不符合篮子的水果类型，那么就必须停止采摘。
# 给你一个整数数组 fruits ，返回你可以收集的水果的 最大 数目。
#
# 示例 1：
# 输入：fruits = [1,2,1]
# 输出：3
# 解释：可以采摘全部 3 棵树。
#
# 示例 2：
# 输入：fruits = [0,1,2,2]
# 输出：3
# 解释：可以采摘 [1,2,2] 这三棵树。
# 如果从第一棵树开始采摘，则只能采摘 [0,1] 这两棵树。
#
# 示例 3：
# 输入：fruits = [1,2,3,2,2]
# 输出：4
# 解释：可以采摘 [2,3,2,2] 这四棵树。
# 如果从第一棵树开始采摘，则只能采摘 [1,2] 这两棵树。
#
# 示例 4：
# 输入：fruits = [3,3,3,1,2,1,1,2,3,3,4]
# 输出：5
# 解释：可以采摘 [1,2,1,1,2] 这五棵树。

#想法1：使用滑动窗口
def pick_more_tree(fruits):
    left = 0
    tree_caracters = {}#记录现在哪些树在窗口里面，窗口里面的树有几颗
    max_tree_num = 0

    #什么时候扩大窗口范围？什么时候缩小窗口范围？——>满足条件（树的颗数小于等于2）时扩大范围，不满足条件时缩小范围（移动左指针）
    for right in range(len(fruits)):
        tree_caracters[fruits[right]] = tree_caracters.get(fruits[right],0)+1#将当前遍历到的水果放入字典，如果字典里已经有这种水果，数量加 1；如果没有，则将其数量初始化为 1。

        while len(tree_caracters)>2:#当字典的长度大于两颗时，需要进行缩小窗口
            tree_caracters[fruits[left]] -= 1
            if tree_caracters[fruits[left]] == 0:
                del tree_caracters[fruits[left]]
            left += 1
        max_tree_num = max(max_tree_num,right-left+1)

    return max_tree_num


if __name__ == "__main__":
    fruits = [1, 2, 1]
    # 输出：3

    # fruits = [0, 1, 2, 2]
    # 输出：3,以采摘 [1,2,2] 这三棵树。

    # fruits = [1, 2, 3, 2, 2]
    # 输出：4
    # 解释：可以采摘 [2,3,2,2] 这四棵树。
    # 如果从第一棵树开始采摘，则只能采摘 [1,2] 这两棵树

    # fruits = [3, 3, 3, 1, 2, 1, 1, 2, 3, 3, 4]
    # 输出：5
    # 解释：可以采摘 [1,2,1,1,2] 这五棵树。

    print( pick_more_tree(fruits))


#1.记录哪些树被采摘过为什么不用数组，而用字典？用列表的话不是用in或者not in就能够判断出来是否在列表中，
# 我们难道不可通过就是数组的长度来判断吗？就是我们在滑动窗口的时候不是要先判断说看这个树在没有在列表里面并且此时列表的长度是多少？
# 如果没有在并且长度为2，那就说明不能够在进行添加树了，然后比较现在窗口的大小和最大值的大小，取两个中最大的一个就可以了，如果没有
# 在并且长度没有达到2，那就往里面添加这个树就可以了，继续滑动，如果树在那就更不用说了，继续滑动
#     列表不够。因为问题在于当左指针向右移动删除当前数的时候


#对字典的操作不熟悉
