# 给定两个字符串 s 和 t，长度分别是 m 和 n，返回 s 中的 最短窗口子串，使得该子串包含 t 中的每一个字符（包括重复字符）。
# 如果没有这样的子串，返回空字符串 ""。
#
# 示例 1：
# 输入：s = "ADOBECODEBANC", t = "ABC"
# 输出："BANC"
# 解释：最小覆盖子串 "BANC" 包含来自字符串 t 的 'A'、'B' 和 'C'
#
# 示例 2：
# 输入：s = "a", t = "a"
# 输出："a"
# 解释：整个字符串 s 是最小覆盖子串
#
# 示例 3:
# 输入: s = "a", t = "aa"
# 输出: ""
# 解释: t 中两个字符 'a' 均应包含在 s 的子串中，
# 因此没有符合条件的子字符串，返回空字符串

def coverage_short(s,t):
    left,right = 0,0
    need = {}#用need字典来存储哪些字符是需要的。关键字是字符，值是字符的数量。<——因为字符可能存在重复的
    window_dic = {}#用该字典来保存当前窗口已经检索到的需要的字符及每个字符的个数
    start_pos = 0#当满足条件的时候，记录起始字符的位置
    min_len = float('inf')
    valid = 0#valid这个变量相当于进度条，用来记录各个字符的达标情况，如果有两个字符A,B且A所需要的字符数是两个，那么当得到了A变量valid也不能增加，因为A还没有满足需要两个A的条件

    #当s的长度比t还短，直接返回空字符串
    if len(s)<len(t):
        return ""

    #将所有需要的字符全部加入到need字典当中去
    for c in t:
        need[c] = need.get(c,0)+1#如果关键字c没有在need中，那么返回默认值0“need.get(c,0)”，如果有need.get(c,0)得到他的数值在加上现在扫描到的一个


    #滑动窗口的方法：什么时候收缩窗口，什么时候扩大窗口——>收缩窗口：满足所有的需要的元素都已经存在（need中的元素全部在window_dic中），left指针右移。扩大窗口：未能满足条件的时候
    while right< len(s):
        #得到即将进入窗口的字符,并让right指向下一个字符
        c = s[right]
        right += 1

        #判断当前字符是否是我们需要的字符，如果是那么就需要将其加入到window_dic中,且判断该字符的个数时否足够了：足够了valid+1
        if c in need:
            window_dic[c] = window_dic.get(c,0)+1
            #判断当前字符是否和我们需要的字符数相等，若相等则该字符数的要求达标，valid加1，如果没有达标，说明还需要改字符，该字符数依旧未达标，valid不能进行加1
            if need[c] == window_dic[c]:#当前字符的值（个数）等于所需要的个数时：
                valid += 1

        #如果当前已经满足条件了，那么就开始缩小窗口，如果没有满足条件那么不需要缩小窗口，通过c = s[right]得到新的字符，right+=1指针依旧继续右移扩大窗口
        while valid==len(need):

            #满足条件需要进行的工作：1.看当前满足条件条件的长度和前面的最小长度谁小，如果是当前长度小，那么进行更新最小长度时起始位置，反之则不用管
            if right-left<min_len:#当前的长度比以前的小
                min_len = right-left
                start_pos = left

            #满足条件需要进行的工作：2.缩小窗口：（1）判断当前左指针所指的元素是否是需要的元素，若是，则从window_dict中删除一个在进行右移，
            # 以及当前的window中该字符数量和所需数量是否一致，若已知，删除了之后valid要-1，若还要多，那么不影响，valid不用删若不是直接右移
            if s[left] in need:
                if window_dic[s[left]] == need[s[left]]:
                    valid -= 1
                window_dic[s[left]] -= 1
            left += 1

    return s[start_pos:start_pos+min_len] if min_len != float('inf') else ""



if __name__ == "__main__":
    # s = "ADOBECODEBANC"
    # t = "ABC"
    # 输出："BANC"

    # s = "a"
    # t = "a"
    # 输出："a"

    s = "a"
    t = "aa"
    # 输出: ""

    print(coverage_short(s,t))



# 1:字符valid的实质：
# 其实，valid 这个变量记录的是每一种字符是否达到了所需的频次要求。
# 比如，如果 t 中需要 2 个 'A'，但当前窗口只扫描到了 1 个 'A'，说明 'A' 的数量还不够。此时，'A' 这个字符还不算达标，所以 valid 加 1 的条件不会被触发（进度条不能前进）。
# 只有当窗口里收集到了 2 个 'A' 时，说明 'A' 的数量已经达标了。在这之后，不管再往窗口里添加多少个 'A'，都不会影响 valid 了，因为我们只需要看其他还没达标的字符什么时候能满足条件。
# 假设 t 中有 3 种不同的字符（比如 A、B、C），那么这 3 种字符都需要分别满足各自所需的频次。只有当这 3 种字符全部达标（各加 1），valid 才能累加到 3。此时 valid == len(need)（即所需字符的种类数），就说明当前窗口已经完全满足要求了。


#2:该题的本质/核心思想